<script>
export default {
    name: "Navbar",
    props: {
        siteSetting: Object,
        auth: Object
    },
    data() {
        return {
            locale: localStorage.getItem('locale') || 'bn'
        };
    },
    methods: {
        getLogoUrl(logoPath) {
            if (!logoPath) {
                return 'default-logo.png';
            }
            return `${window.location.origin}/${logoPath}`;
        },

        changeLanguage(lang) {
            this.locale = lang;
            localStorage.setItem('locale', lang);
            window.location.reload();
        },
        redirectToDashboard() {
            window.location.href = "/user/dashboard";
        }
    },
}
</script>

<template>
    <header class="site-header-area" id="garments-niyog-header">
        <div class="container">
            <div class="site-header-wrapper">
                <div class="menu-left">
                    <Link href="/">
                        <img :src="getLogoUrl(siteSetting?.logo)" alt="">
                    </Link>
                    <nav class="site-navigation d-none d-lg-block">
                        <ul class="menu-list">
                            <li>
                                <Link href="/">
                                    {{ locale === 'en' ? 'Home' : 'হোম' }}
                                </Link>
                            </li>
                            <li>
                                <Link href="/about-us">
                                    {{ locale === 'en' ? 'About Us' : 'আমাদের সম্পর্কে' }}
                                </Link>
                            </li>
                            <li>
                                <Link href="/job-board">
                                    {{ locale === 'en' ? 'Browse Job' : 'জব' }}
                                </Link>
                            </li>
                            <li>
                                <Link href="/training">Training</Link>
                            </li>
                            <li class="dropdown">
                                <a
                                    href="#"
                                    role="button"
                                    class="dropdown-toggle"
                                    data-bs-toggle="dropdown"
                                    aria-expanded="false"
                                >Resources
                                    <svg
                                        xmlns="http://www.w3.org/2000/svg"
                                        width="24"
                                        height="24"
                                        viewBox="0 0 24 24"
                                        fill="none"
                                    >
                                        <path
                                            d="M18 9.00005C18 9.00005 13.5811 15 12 15C10.4188 15 6 9 6 9"
                                            stroke="currentColor"
                                            stroke-width="1.5"
                                            stroke-linecap="round"
                                            stroke-linejoin="round"
                                        />
                                    </svg>
                                </a>
                                <ul class="dropdown-menu">
                                    <li>
                                        <a href="events.html"
                                        ><svg
                                            xmlns="http://www.w3.org/2000/svg"
                                            width="16"
                                            height="17"
                                            viewBox="0 0 16 17"
                                            fill="none"
                                        >
                                            <path
                                                d="M12.6667 2.50008H12V1.16675H10.6667V2.50008H5.33333V1.16675H4V2.50008H3.33333C2.97971 2.50008 2.64057 2.64056 2.39052 2.89061C2.14048 3.14065 2 3.47979 2 3.83341V13.1667C2 13.5204 2.14048 13.8595 2.39052 14.1096C2.64057 14.3596 2.97971 14.5001 3.33333 14.5001H12.6667C13.4067 14.5001 14 13.9067 14 13.1667V3.83341C14 3.47979 13.8595 3.14065 13.6095 2.89061C13.3594 2.64056 13.0203 2.50008 12.6667 2.50008ZM12.6667 13.1667H3.33333V6.50008H12.6667V13.1667ZM12.6667 5.16675H3.33333V3.83341H12.6667V5.16675Z"
                                                fill="currentColor"
                                            />
                                        </svg>
                                            Events</a
                                        >
                                    </li>

                                    <li>
                                        <Link href="/blog">
                                            <svg
                                                xmlns="http://www.w3.org/2000/svg"
                                                width="16"
                                                height="17"
                                                viewBox="0 0 16 17"
                                                fill="none"
                                            >
                                                <path
                                                    d="M14.526 1.4866L14.9194 1.87994C15.4614 2.4226 15.3794 3.3846 14.7347 4.0286L6.62337 12.1399L3.99537 13.1013C3.66537 13.2226 3.34404 13.0653 3.2787 12.7513C3.25669 12.6374 3.26709 12.5196 3.3087 12.4113L4.2887 9.7606L12.3774 1.67127C13.022 1.02727 13.984 0.943935 14.526 1.4866ZM6.26937 2.29327C6.35692 2.29327 6.44361 2.31051 6.52449 2.34402C6.60537 2.37752 6.67887 2.42663 6.74077 2.48853C6.80268 2.55044 6.85178 2.62393 6.88529 2.70481C6.91879 2.7857 6.93603 2.87239 6.93603 2.95994C6.93603 3.04748 6.91879 3.13417 6.88529 3.21506C6.85178 3.29594 6.80268 3.36943 6.74077 3.43134C6.67887 3.49325 6.60537 3.54235 6.52449 3.57586C6.44361 3.60936 6.35692 3.6266 6.26937 3.6266H3.6027C3.24908 3.6266 2.90994 3.76708 2.65989 4.01713C2.40984 4.26717 2.26937 4.60631 2.26937 4.95994V12.9599C2.26937 13.3136 2.40984 13.6527 2.65989 13.9027C2.90994 14.1528 3.24908 14.2933 3.6027 14.2933H11.6027C11.9563 14.2933 12.2955 14.1528 12.5455 13.9027C12.7956 13.6527 12.936 13.3136 12.936 12.9599V10.2933C12.936 10.1165 13.0063 9.94689 13.1313 9.82187C13.2563 9.69684 13.4259 9.6266 13.6027 9.6266C13.7795 9.6266 13.9491 9.69684 14.0741 9.82187C14.1991 9.94689 14.2694 10.1165 14.2694 10.2933V12.9599C14.2694 13.6672 13.9884 14.3455 13.4883 14.8456C12.9882 15.3457 12.3099 15.6266 11.6027 15.6266H3.6027C2.89546 15.6266 2.21718 15.3457 1.71708 14.8456C1.21699 14.3455 0.936035 13.6672 0.936035 12.9599V4.95994C0.936035 4.25269 1.21699 3.57441 1.71708 3.07432C2.21718 2.57422 2.89546 2.29327 3.6027 2.29327H6.26937Z"
                                                    fill="currentColor"
                                                />
                                            </svg>
                                            Blogs
                                        </Link>
                                    </li>
                                </ul>
                            </li>
                            <li>
                                <Link href="/contact">
                                    {{ locale === 'en' ? 'Contact Us' : 'যোগাযোগ' }}
                                </Link>
                            </li>
                        </ul>
                    </nav>
                </div>
                <div class="menu-right">
                    <button
                        id="languageSwitcher"
                        class="switcher"
                        role="switch"
                        :aria-checked="locale === 'en'"
                        @click="changeLanguage(locale === 'en' ? 'bn' : 'en')"
                    >
                        <span class="language" :class="{ active: locale === 'en' }">EN</span>
                        <div class="toggle" :class="{ active: locale === 'en' }"></div>
                        <span class="language" :class="{ active: locale === 'bn' }">BN </span>
                    </button>
                    <div class="d-block d-lg-none">
                        <button
                            class="navbar-toggler"
                            type="button"
                            data-bs-toggle="offcanvas"
                            data-bs-target="#offcanvasNavbar"
                            aria-controls="offcanvasNavbar"
                            aria-label="Toggle navigation"
                        >
                            <svg
                                xmlns="http://www.w3.org/2000/svg"
                                fill="none"
                                viewBox="0 0 24 24"
                                strokeWidth="2"
                                stroke="currentColor"
                            >
                                <path
                                    strokeLinecap="round"
                                    strokeLinejoin="round"
                                    d="M3.75 6.75h16.5M3.75 12h16.5m-16.5 5.25h16.5"
                                />
                            </svg>
                        </button>
                    </div>

                    <div v-if="auth && auth.role === 'user'">
                        <a @click="redirectToDashboard" class="theme-btn d-none d-lg-block">

                            <span v-if="locale === 'en'"> {{ auth.name }}</span>
                            <span v-else> {{ auth.name_bn }}</span>
                        </a>
                    </div>
                    <div v-else>
                        <a href="/login" class="theme-btn d-none d-lg-block"
                        >{{ locale === 'en' ? 'SignUp / SignIn' : 'লগইন/রেজিস্ট্রেশন' }}</a
                        >
                    </div>


                    <a href="/company-registration-start" class="theme-btn d-none d-lg-block"
                    >{{ locale === 'en' ? 'Company ' : 'কোম্পানি' }}</a
                    >
                </div>
            </div>
        </div>
    </header>

    <div
        class="offcanvas offcanvas-end mobile-device-offcanvas"
        tabindex="-1"
        id="offcanvasNavbar"
        aria-labelledby="offcanvasNavbarLabel"
    >
        <div class="offcanvas-header">
            <button
                type="button"
                class="btn-close"
                data-bs-dismiss="offcanvas"
                aria-label="Close"
            ></button>
        </div>
        <div class="offcanvas-body">
            <div class="menu-left">
                <nav class="site-navigation">
                    <ul class="menu-list">
                        <li>
                            <a href="index.html" class="active">Home</a>
                        </li>
                        <li><a href="about.html">About Us</a></li>
                        <li><a href="jobs.html">Browse Jobs</a></li>
                        <li><a href="training.html">Training</a></li>
                        <li class="dropdown">
                            <a
                                href="#"
                                role="button"
                                class="dropdown-toggle"
                                data-bs-toggle="dropdown"
                                aria-expanded="false"
                            >Resources
                                <svg
                                    xmlns="http://www.w3.org/2000/svg"
                                    width="24"
                                    height="24"
                                    viewBox="0 0 24 24"
                                    fill="none"
                                >
                                    <path
                                        d="M18 9.00005C18 9.00005 13.5811 15 12 15C10.4188 15 6 9 6 9"
                                        stroke="currentColor"
                                        stroke-width="1.5"
                                        stroke-linecap="round"
                                        stroke-linejoin="round"
                                    />
                                </svg>
                            </a>
                            <ul class="dropdown-menu">
                                <li>
                                    <a href="events.html"
                                    ><svg
                                        xmlns="http://www.w3.org/2000/svg"
                                        width="16"
                                        height="17"
                                        viewBox="0 0 16 17"
                                        fill="none"
                                    >
                                        <path
                                            d="M12.6667 2.50008H12V1.16675H10.6667V2.50008H5.33333V1.16675H4V2.50008H3.33333C2.97971 2.50008 2.64057 2.64056 2.39052 2.89061C2.14048 3.14065 2 3.47979 2 3.83341V13.1667C2 13.5204 2.14048 13.8595 2.39052 14.1096C2.64057 14.3596 2.97971 14.5001 3.33333 14.5001H12.6667C13.4067 14.5001 14 13.9067 14 13.1667V3.83341C14 3.47979 13.8595 3.14065 13.6095 2.89061C13.3594 2.64056 13.0203 2.50008 12.6667 2.50008ZM12.6667 13.1667H3.33333V6.50008H12.6667V13.1667ZM12.6667 5.16675H3.33333V3.83341H12.6667V5.16675Z"
                                            fill="currentColor"
                                        />
                                    </svg>
                                        Events</a
                                    >
                                </li>
                                <li>
                                    <a href="#">
                                        <svg
                                            xmlns="http://www.w3.org/2000/svg"
                                            width="16"
                                            height="17"
                                            viewBox="0 0 16 17"
                                            fill="none"
                                        >
                                            <g
                                                clip-path="url(#clip0_219_4796)"
                                            >
                                                <path
                                                    d="M8 5C8.33152 5 8.64946 4.8683 8.88388 4.63388C9.1183 4.39946 9.25 4.08152 9.25 3.75C9.25 3.41848 9.1183 3.10054 8.88388 2.86612C8.64946 2.6317 8.33152 2.5 8 2.5C7.66848 2.5 7.35054 2.6317 7.11612 2.86612C6.8817 3.10054 6.75 3.41848 6.75 3.75C6.75 4.08152 6.8817 4.39946 7.11612 4.63388C7.35054 4.8683 7.66848 5 8 5Z"
                                                    fill="currentColor"
                                                />
                                                <path
                                                    d="M8 5C8.597 5 9.13 5.382 9.32 5.949L9.407 6.209C9.41834 6.24226 9.42155 6.27775 9.41636 6.3125C9.41117 6.34725 9.39773 6.38026 9.37717 6.40875C9.35661 6.43724 9.32952 6.4604 9.29818 6.47627C9.26683 6.49215 9.23214 6.50028 9.197 6.5H6.807C6.77202 6.49984 6.73756 6.49142 6.70645 6.47542C6.67534 6.45941 6.64846 6.43628 6.62798 6.40791C6.60751 6.37955 6.59403 6.34674 6.58865 6.31217C6.58326 6.2776 6.58613 6.24225 6.597 6.209L6.684 5.949C6.77657 5.67229 6.95388 5.43173 7.19079 5.2614C7.42771 5.09107 7.71221 4.99962 8.004 5H8ZM5 9C5 8.86739 5.05268 8.74022 5.14645 8.64645C5.24021 8.55268 5.36739 8.5 5.5 8.5H10.5C10.6326 8.5 10.7598 8.55268 10.8536 8.64645C10.9473 8.74022 11 8.86739 11 9C11 9.13261 10.9473 9.25979 10.8536 9.35355C10.7598 9.44732 10.6326 9.5 10.5 9.5H5.5C5.36739 9.5 5.24021 9.44732 5.14645 9.35355C5.05268 9.25979 5 9.13261 5 9ZM5 11C5 10.8674 5.05268 10.7402 5.14645 10.6464C5.24021 10.5527 5.36739 10.5 5.5 10.5H10.5C10.6326 10.5 10.7598 10.5527 10.8536 10.6464C10.9473 10.7402 11 10.8674 11 11C11 11.1326 10.9473 11.2598 10.8536 11.3536C10.7598 11.4473 10.6326 11.5 10.5 11.5H5.5C5.36739 11.5 5.24021 11.4473 5.14645 11.3536C5.05268 11.2598 5 11.1326 5 11ZM5.5 12.5C5.36739 12.5 5.24021 12.5527 5.14645 12.6464C5.05268 12.7402 5 12.8674 5 13C5 13.1326 5.05268 13.2598 5.14645 13.3536C5.24021 13.4473 5.36739 13.5 5.5 13.5H7.5C7.63261 13.5 7.75979 13.4473 7.85355 13.3536C7.94732 13.2598 8 13.1326 8 13C8 12.8674 7.94732 12.7402 7.85355 12.6464C7.75979 12.5527 7.63261 12.5 7.5 12.5H5.5Z"
                                                    fill="currentColor"
                                                />
                                                <path
                                                    fill-rule="evenodd"
                                                    clip-rule="evenodd"
                                                    d="M2.32993 2.13993C2.00293 2.78193 2.00293 3.61993 2.00293 5.29993V11.6999C2.00293 13.3799 2.00293 14.2199 2.32993 14.8599C2.61857 15.4231 3.0768 15.8813 3.63993 16.1699C4.28193 16.4969 5.11993 16.4969 6.79993 16.4969H9.19993C10.8799 16.4969 11.7199 16.4969 12.3599 16.1699C12.9239 15.8824 13.3824 15.4239 13.6699 14.8599C13.9969 14.2179 13.9969 13.3799 13.9969 11.6999V5.29993C13.9969 3.61993 13.9969 2.77993 13.6699 2.13993C13.3824 1.57599 12.9239 1.11745 12.3599 0.82993C11.7179 0.50293 10.8799 0.50293 9.19993 0.50293H6.79993C5.11993 0.50293 4.27993 0.50293 3.63993 0.82993C3.0768 1.11857 2.61857 1.5768 2.32993 2.13993ZM9.19993 1.50193H6.79993C5.94293 1.50193 5.35993 1.50193 4.90993 1.53993C4.47193 1.57493 4.24693 1.63993 4.09093 1.71993C3.71462 1.91167 3.40867 2.21762 3.21693 2.59393C3.13693 2.74993 3.07193 2.97393 3.03693 3.41293C2.99993 3.86293 2.99893 4.44293 2.99893 5.30293V11.7029C2.99893 12.5599 2.99993 13.1429 3.03693 13.5929C3.07293 14.0309 3.13793 14.2559 3.21693 14.4119C3.40893 14.7879 3.71493 15.0939 4.09093 15.2859C4.24693 15.3659 4.47193 15.4309 4.90993 15.4659C5.35993 15.5019 5.93993 15.5029 6.79993 15.5029H9.19993C10.0569 15.5029 10.6399 15.5029 11.0899 15.4659C11.5279 15.4299 11.7529 15.3649 11.9089 15.2859C12.2849 15.0939 12.5909 14.7879 12.7829 14.4119C12.8629 14.2559 12.9279 14.0309 12.9629 13.5919C12.9999 13.1419 13.0009 12.5619 13.0009 11.7019V5.30193C13.0009 4.44593 12.9999 3.86193 12.9629 3.41193C12.9269 2.97493 12.8619 2.74993 12.7829 2.59393C12.5912 2.21762 12.2852 1.91167 11.9089 1.71993C11.7529 1.63993 11.5279 1.57493 11.0899 1.53993C10.6399 1.50293 10.0599 1.50193 9.19993 1.50193Z"
                                                    fill="currentColor"
                                                />
                                            </g>
                                            <defs>
                                                <clipPath
                                                    id="clip0_219_4796"
                                                >
                                                    <rect
                                                        width="16"
                                                        height="16"
                                                        fill="white"
                                                        transform="translate(0 0.5)"
                                                    />
                                                </clipPath>
                                            </defs>
                                        </svg>
                                        Resume
                                    </a>
                                </li>
                                <li>
                                    <a href="blog.html">
                                        <svg
                                            xmlns="http://www.w3.org/2000/svg"
                                            width="16"
                                            height="17"
                                            viewBox="0 0 16 17"
                                            fill="none"
                                        >
                                            <path
                                                d="M14.526 1.4866L14.9194 1.87994C15.4614 2.4226 15.3794 3.3846 14.7347 4.0286L6.62337 12.1399L3.99537 13.1013C3.66537 13.2226 3.34404 13.0653 3.2787 12.7513C3.25669 12.6374 3.26709 12.5196 3.3087 12.4113L4.2887 9.7606L12.3774 1.67127C13.022 1.02727 13.984 0.943935 14.526 1.4866ZM6.26937 2.29327C6.35692 2.29327 6.44361 2.31051 6.52449 2.34402C6.60537 2.37752 6.67887 2.42663 6.74077 2.48853C6.80268 2.55044 6.85178 2.62393 6.88529 2.70481C6.91879 2.7857 6.93603 2.87239 6.93603 2.95994C6.93603 3.04748 6.91879 3.13417 6.88529 3.21506C6.85178 3.29594 6.80268 3.36943 6.74077 3.43134C6.67887 3.49325 6.60537 3.54235 6.52449 3.57586C6.44361 3.60936 6.35692 3.6266 6.26937 3.6266H3.6027C3.24908 3.6266 2.90994 3.76708 2.65989 4.01713C2.40984 4.26717 2.26937 4.60631 2.26937 4.95994V12.9599C2.26937 13.3136 2.40984 13.6527 2.65989 13.9027C2.90994 14.1528 3.24908 14.2933 3.6027 14.2933H11.6027C11.9563 14.2933 12.2955 14.1528 12.5455 13.9027C12.7956 13.6527 12.936 13.3136 12.936 12.9599V10.2933C12.936 10.1165 13.0063 9.94689 13.1313 9.82187C13.2563 9.69684 13.4259 9.6266 13.6027 9.6266C13.7795 9.6266 13.9491 9.69684 14.0741 9.82187C14.1991 9.94689 14.2694 10.1165 14.2694 10.2933V12.9599C14.2694 13.6672 13.9884 14.3455 13.4883 14.8456C12.9882 15.3457 12.3099 15.6266 11.6027 15.6266H3.6027C2.89546 15.6266 2.21718 15.3457 1.71708 14.8456C1.21699 14.3455 0.936035 13.6672 0.936035 12.9599V4.95994C0.936035 4.25269 1.21699 3.57441 1.71708 3.07432C2.21718 2.57422 2.89546 2.29327 3.6027 2.29327H6.26937Z"
                                                fill="currentColor"
                                            />
                                        </svg>
                                        Blogs
                                    </a>
                                </li>
                            </ul>
                        </li>
                        <li>
                            <a href="contact-us.html">Contact Us</a>
                        </li>
                    </ul>
                    <a href="#" class="theme-btn">Register/ Log in</a>
                    <a href="#" class="theme-btn">Company</a>
                </nav>
            </div>
        </div>
    </div>
</template>
<style scoped>

</style>





